workloads/YCSB_rocksdb/luma_test_logs/workloadA_logs/ext4_4dev
<YCSB RocksDB benchmark script>
load YCSB-a x1 & run YCSB-a x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 49167
[OVERALL], Throughput(ops/sec), 20.338845160371793
[TOTAL_GCS_G1_Young_Generation], Count, 107
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 498
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.0128744889865153
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 107
[TOTAL_GC_TIME], Time(ms), 498
[TOTAL_GC_TIME_%], Time(%), 1.0128744889865153
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 3164.859375
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 202111
[CLEANUP], 95thPercentileLatency(us), 12
[CLEANUP], 99thPercentileLatency(us), 33
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 2975156.224
[INSERT], MinLatency(us), 1067008
[INSERT], MaxLatency(us), 4169727
[INSERT], 95thPercentileLatency(us), 3815423
[INSERT], 99thPercentileLatency(us), 3954687
[INSERT], Return=OK, 1000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 110780
[OVERALL], Throughput(ops/sec), 9.026900162484203
[TOTAL_GCS_G1_Young_Generation], Count, 210
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2648
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.390323163025817
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 210
[TOTAL_GC_TIME], Time(ms), 2648
[TOTAL_GC_TIME_%], Time(%), 2.390323163025817
[READ], Operations, 500
[READ], AverageLatency(us), 672117.8
[READ], MinLatency(us), 15584
[READ], MaxLatency(us), 4628479
[READ], 95thPercentileLatency(us), 3489791
[READ], 99thPercentileLatency(us), 4304895
[READ], Return=OK, 500
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 3450.671875
[CLEANUP], MinLatency(us), 6
[CLEANUP], MaxLatency(us), 219519
[CLEANUP], 95thPercentileLatency(us), 52
[CLEANUP], 99thPercentileLatency(us), 68
[UPDATE], Operations, 500
[UPDATE], AverageLatency(us), 1.2594178432E7
[UPDATE], MinLatency(us), 209792
[UPDATE], MaxLatency(us), 69795839
[UPDATE], 95thPercentileLatency(us), 66519039
[UPDATE], 99thPercentileLatency(us), 69009407
[UPDATE], Return=OK, 500
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 62122
[OVERALL], Throughput(ops/sec), 16.09735681401114
[TOTAL_GCS_G1_Young_Generation], Count, 181
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1340
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.1570458130774925
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 181
[TOTAL_GC_TIME], Time(ms), 1340
[TOTAL_GC_TIME_%], Time(%), 2.1570458130774925
[READ], Operations, 494
[READ], AverageLatency(us), 653719.5627530364
[READ], MinLatency(us), 23744
[READ], MaxLatency(us), 3944447
[READ], 95thPercentileLatency(us), 2428927
[READ], 99thPercentileLatency(us), 3893247
[READ], Return=OK, 494
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 4622.4375
[CLEANUP], MinLatency(us), 8
[CLEANUP], MaxLatency(us), 294655
[CLEANUP], 95thPercentileLatency(us), 39
[CLEANUP], 99thPercentileLatency(us), 145
[UPDATE], Operations, 506
[UPDATE], AverageLatency(us), 6215255.652173913
[UPDATE], MinLatency(us), 196992
[UPDATE], MaxLatency(us), 17022975
[UPDATE], 95thPercentileLatency(us), 12115967
[UPDATE], 99thPercentileLatency(us), 15220735
[UPDATE], Return=OK, 506
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 67627
[OVERALL], Throughput(ops/sec), 14.78699336063998
[TOTAL_GCS_G1_Young_Generation], Count, 66
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1319
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.9504044242684135
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 66
[TOTAL_GC_TIME], Time(ms), 1319
[TOTAL_GC_TIME_%], Time(%), 1.9504044242684135
[READ], Operations, 478
[READ], AverageLatency(us), 636016.6359832636
[READ], MinLatency(us), 17872
[READ], MaxLatency(us), 2711551
[READ], 95thPercentileLatency(us), 1549311
[READ], 99thPercentileLatency(us), 2637823
[READ], Return=OK, 478
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 14861.5
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 950271
[CLEANUP], 95thPercentileLatency(us), 29
[CLEANUP], 99thPercentileLatency(us), 54
[UPDATE], Operations, 522
[UPDATE], AverageLatency(us), 6752097.593869732
[UPDATE], MinLatency(us), 273664
[UPDATE], MaxLatency(us), 22478847
[UPDATE], 95thPercentileLatency(us), 20217855
[UPDATE], 99thPercentileLatency(us), 21692415
[UPDATE], Return=OK, 522
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 73635
[OVERALL], Throughput(ops/sec), 13.580498404291438
[TOTAL_GCS_G1_Young_Generation], Count, 62
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1054
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.4313845318123175
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 62
[TOTAL_GC_TIME], Time(ms), 1054
[TOTAL_GC_TIME_%], Time(%), 1.4313845318123175
[READ], Operations, 500
[READ], AverageLatency(us), 605205.136
[READ], MinLatency(us), 20400
[READ], MaxLatency(us), 2402303
[READ], 95thPercentileLatency(us), 1703935
[READ], 99thPercentileLatency(us), 1918975
[READ], Return=OK, 500
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 10854.84375
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 693247
[CLEANUP], 95thPercentileLatency(us), 63
[CLEANUP], 99thPercentileLatency(us), 72
[UPDATE], Operations, 500
[UPDATE], AverageLatency(us), 7831793.152
[UPDATE], MinLatency(us), 340224
[UPDATE], MaxLatency(us), 24215551
[UPDATE], 95thPercentileLatency(us), 19988479
[UPDATE], 99thPercentileLatency(us), 22429695
[UPDATE], Return=OK, 500
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 75426
[OVERALL], Throughput(ops/sec), 13.258027735794023
[TOTAL_GCS_G1_Young_Generation], Count, 142
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2014
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.670166785988916
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 142
[TOTAL_GC_TIME], Time(ms), 2014
[TOTAL_GC_TIME_%], Time(%), 2.670166785988916
[READ], Operations, 480
[READ], AverageLatency(us), 707816.8833333333
[READ], MinLatency(us), 23792
[READ], MaxLatency(us), 4034559
[READ], 95thPercentileLatency(us), 2050047
[READ], 99thPercentileLatency(us), 3381247
[READ], Return=OK, 480
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 11608.5
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 741887
[CLEANUP], 95thPercentileLatency(us), 79
[CLEANUP], 99thPercentileLatency(us), 109
[UPDATE], Operations, 520
[UPDATE], AverageLatency(us), 7441634.276923077
[UPDATE], MinLatency(us), 122304
[UPDATE], MaxLatency(us), 30916607
[UPDATE], 95thPercentileLatency(us), 23134207
[UPDATE], 99thPercentileLatency(us), 24346623
[UPDATE], Return=OK, 520
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 67865
[OVERALL], Throughput(ops/sec), 14.73513593162897
[TOTAL_GCS_G1_Young_Generation], Count, 120
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1605
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.3649893170264495
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 120
[TOTAL_GC_TIME], Time(ms), 1605
[TOTAL_GC_TIME_%], Time(%), 2.3649893170264495
[READ], Operations, 509
[READ], AverageLatency(us), 723763.0648330059
[READ], MinLatency(us), 21120
[READ], MaxLatency(us), 3930111
[READ], 95thPercentileLatency(us), 2308095
[READ], 99thPercentileLatency(us), 3620863
[READ], Return=OK, 509
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8042.28125
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 513791
[CLEANUP], 95thPercentileLatency(us), 26
[CLEANUP], 99thPercentileLatency(us), 32
[UPDATE], Operations, 491
[UPDATE], AverageLatency(us), 7108715.731160896
[UPDATE], MinLatency(us), 127040
[UPDATE], MaxLatency(us), 17940479
[UPDATE], 95thPercentileLatency(us), 16318463
[UPDATE], 99thPercentileLatency(us), 17072127
[UPDATE], Return=OK, 491
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 64406
[OVERALL], Throughput(ops/sec), 15.526503741887401
[TOTAL_GCS_G1_Young_Generation], Count, 74
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1184
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.8383380430394682
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 74
[TOTAL_GC_TIME], Time(ms), 1184
[TOTAL_GC_TIME_%], Time(%), 1.8383380430394682
[READ], Operations, 506
[READ], AverageLatency(us), 652563.581027668
[READ], MinLatency(us), 13504
[READ], MaxLatency(us), 3530751
[READ], 95thPercentileLatency(us), 2861055
[READ], 99thPercentileLatency(us), 3305471
[READ], Return=OK, 506
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 4699.015625
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 299519
[CLEANUP], 95thPercentileLatency(us), 46
[CLEANUP], 99thPercentileLatency(us), 64
[UPDATE], Operations, 494
[UPDATE], AverageLatency(us), 6810271.093117408
[UPDATE], MinLatency(us), 312320
[UPDATE], MaxLatency(us), 15753215
[UPDATE], 95thPercentileLatency(us), 13697023
[UPDATE], 99thPercentileLatency(us), 14901247
[UPDATE], Return=OK, 494
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 62338
[OVERALL], Throughput(ops/sec), 16.04157977477622
[TOTAL_GCS_G1_Young_Generation], Count, 119
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1204
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.9314062048830567
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 119
[TOTAL_GC_TIME], Time(ms), 1204
[TOTAL_GC_TIME_%], Time(%), 1.9314062048830567
[READ], Operations, 534
[READ], AverageLatency(us), 726964.6441947565
[READ], MinLatency(us), 22896
[READ], MaxLatency(us), 3051519
[READ], 95thPercentileLatency(us), 2081791
[READ], 99thPercentileLatency(us), 3000319
[READ], Return=OK, 534
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 4761.578125
[CLEANUP], MinLatency(us), 6
[CLEANUP], MaxLatency(us), 303359
[CLEANUP], 95thPercentileLatency(us), 88
[CLEANUP], 99thPercentileLatency(us), 256
[UPDATE], Operations, 466
[UPDATE], AverageLatency(us), 6609161.888412017
[UPDATE], MinLatency(us), 359168
[UPDATE], MaxLatency(us), 16564223
[UPDATE], 95thPercentileLatency(us), 14188543
[UPDATE], 99thPercentileLatency(us), 15818751
[UPDATE], Return=OK, 466
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 66663
[OVERALL], Throughput(ops/sec), 15.000825045377496
[TOTAL_GCS_G1_Young_Generation], Count, 108
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1359
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.0386121236668013
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 108
[TOTAL_GC_TIME], Time(ms), 1359
[TOTAL_GC_TIME_%], Time(%), 2.0386121236668013
[READ], Operations, 495
[READ], AverageLatency(us), 817085.1474747475
[READ], MinLatency(us), 15864
[READ], MaxLatency(us), 4612095
[READ], 95thPercentileLatency(us), 3332095
[READ], 99thPercentileLatency(us), 3985407
[READ], Return=OK, 495
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 4972.5625
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 316927
[CLEANUP], 95thPercentileLatency(us), 36
[CLEANUP], 99thPercentileLatency(us), 336
[UPDATE], Operations, 505
[UPDATE], AverageLatency(us), 6630170.994059406
[UPDATE], MinLatency(us), 133504
[UPDATE], MaxLatency(us), 17301503
[UPDATE], 95thPercentileLatency(us), 14180351
[UPDATE], 99thPercentileLatency(us), 16146431
[UPDATE], Return=OK, 505
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 68628
[OVERALL], Throughput(ops/sec), 14.571312000932563
[TOTAL_GCS_G1_Young_Generation], Count, 109
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1612
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.3488954945503293
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 109
[TOTAL_GC_TIME], Time(ms), 1612
[TOTAL_GC_TIME_%], Time(%), 2.3488954945503293
[READ], Operations, 479
[READ], AverageLatency(us), 660137.0521920668
[READ], MinLatency(us), 24256
[READ], MaxLatency(us), 3076095
[READ], 95thPercentileLatency(us), 2024447
[READ], 99thPercentileLatency(us), 2633727
[READ], Return=OK, 479
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 16341.34375
[CLEANUP], MinLatency(us), 9
[CLEANUP], MaxLatency(us), 1044991
[CLEANUP], 95thPercentileLatency(us), 37
[CLEANUP], 99thPercentileLatency(us), 60
[UPDATE], Operations, 521
[UPDATE], AverageLatency(us), 6860385.2898272555
[UPDATE], MinLatency(us), 281344
[UPDATE], MaxLatency(us), 19726335
[UPDATE], 95thPercentileLatency(us), 18087935
[UPDATE], 99thPercentileLatency(us), 19365887
[UPDATE], Return=OK, 521
*---------------------------------- ycsb run end ------------------------------*
experiment end.